"""main.py
    Возведение числа а в степень b
    (с) Тептеев А.Е (группа КЭ-141)
    22-ноя-19"""
if __name__ == '__main__':
    from modulePower import *
    # Основная программа
    a, b = map(int, input('Введите основание a и степень b через пробел: ').split())
    print(power(a, b))

    
# Test 1: 3 -2
# 0.1111111111111111

# Test 2: 0 0
# 1

# Test 3: 0 -4
# 0

# Test 4: 0 5
# 0

# Test 5: 1 -123
# 1

# Test 6: 12 -2
# 0.006944444444444444

# Test 7: 12 0
# 0

# Test 8: 1 0
# 1

# Test 9: -5 -4
# 0.0016000000000000005

# Test 10: -4 0
# 1

# Test 11: -1 3
# -1
